{
  "s2":[
    ["analyse","#1B5DD8","cours: Analyse Spatiale II","2/1/4/2","Ce cours approfondit l’étude des espaces architecturaux en abordant la relation entre le mur, la lumière et la composition spatiale. Il vise à développer une compréhension fine des volumes et de leur organisation à travers l’analyse graphique, les maquettes et la modélisation 3D. Les étudiants exploreront différents outils de représentation spatiale et expérimenteront des méthodes d’analyse appliquées à l’architecture contemporaine et historique."],
    ["ang","#B3121F","cours: Anglais Général 2","4/1/6/2","Ce cours vise à renforcer les compétences linguistiques des étudiants en anglais, avec un accent sur la communication académique et professionnelle. Il couvre la compréhension orale et écrite, la rédaction de documents formels (emails, rapports) et l’expression orale à travers des présentations et des débats."],
    ["brick","#44B85D","cours: Introduction au Béton Armé","4/2/6/2","Ce cours introduit les principes fondamentaux du béton armé en tant que matériau de construction essentiel. Il couvre sa composition, ses propriétés mécaniques, et les bases du dimensionnement des structures en béton armé. Les étudiants apprendront également les techniques de mise en œuvre et les applications architecturales du béton dans les projets modernes et traditionnels."],
    ["cfl","#A8C0D1","cours: Couleurs, Formes et Lumière","2/4/5/5","Ce cours explore l’impact des couleurs, des formes et de la lumière sur la perception architecturale et l’ambiance des espaces. À travers des études de cas et des expérimentations, les étudiants développeront une sensibilité artistique et plastique, appliquée à la conception architecturale et à la représentation graphique."],
    ["devp","#EC8BD7","cours: Dynamique de Groupe et Développement Personnel","5/4/6/4","L’architecture est une discipline collaborative nécessitant une communication efficace et un bon travail en équipe. Ce cours permet aux étudiants de mieux comprendre la dynamique des groupes, d’améliorer leurs compétences interpersonnelles et de développer leur confiance en soi. Des techniques de gestion du stress et de résolution de conflits seront également abordées."],
    ["mrp","#01924F","cours: Moyen-Âge, Renaissance et Pré-modernité","2/2/4/4","L’histoire de l’architecture est marquée par des évolutions majeures entre le Moyen-Âge et la période pré-moderne. Ce cours explore les styles architecturaux du gothique à la Renaissance, ainsi que la transition vers l’architecture pré-moderne. Il met en lumière les innovations techniques et les principes de composition qui ont influencé la conception des bâtiments à travers ces périodes."],
    ["pgc","#E58032","cours: Procédés Généraux de Construction","4/3/6/4","L’objectif de ce cours est d’enseigner les différentes étapes du processus de construction, des fondations aux finitions. Il aborde les matériaux utilisés, les systèmes constructifs et les techniques d’assemblage. Les étudiants apprendront à analyser et à choisir les procédés les plus adaptés à un projet en fonction des contraintes techniques et environnementales."]
  ]
}